; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v8 ?v4)
             (pred_8 ?v11 ?v7)
             (pred_6 ?v8 ?v7)
             (pred_2 ?v10 ?v8 )
	     (pred_11 ?v8)
             (pred_5 ?v5)
             (pred_12 ?v11)
             (pred_10 ?v7)
             (pred_3 ?v8)
             (pred_9 ?v11)
             (pred_1 ?v8)
             (pred_7 ))



(:action op_4
:parameters (?v12 ?v1 ?v2 ?v9)
:precondition (and (pred_5 ?v12) (pred_5 ?v1) (pred_12 ?v2) (pred_10 ?v9)
          (pred_4 ?v12 ?v1) (pred_8 ?v2 ?v9)
                   (pred_6 ?v1 ?v9) (pred_11 ?v12) 
                   (pred_3 ?v1) (pred_9 ?v2))
:effect (and  (pred_1 ?v1) (not (pred_3 ?v1))))


(:action op_3
:parameters (?v12 ?v6)
:precondition (and (pred_5 ?v12) (pred_5 ?v6)
               (pred_11 ?v12) (pred_4 ?v12 ?v6) (pred_1 ?v6))
:effect (and (pred_11 ?v6) (not (pred_11 ?v12))))

(:action op_1
:parameters (?v12 ?v2)
:precondition (and (pred_5 ?v12) (pred_12 ?v2) 
                  (pred_11 ?v12) (pred_2 ?v2 ?v12) (pred_7 ))
:effect (and (pred_9 ?v2)
   (not (pred_2 ?v2 ?v12)) (not (pred_7 ))))


(:action op_5
:parameters (?v12 ?v13 ?v3)
:precondition (and (pred_5 ?v12) (pred_12 ?v13) (pred_12 ?v3)
                  (pred_11 ?v12) (pred_9 ?v3) (pred_2 ?v13 ?v12))
:effect (and (pred_9 ?v13) (pred_2 ?v3 ?v12)
        (not (pred_9 ?v3)) (not (pred_2 ?v13 ?v12))))

(:action op_2
:parameters (?v12 ?v2)
:precondition (and (pred_5 ?v12) (pred_12 ?v2) 
                  (pred_11 ?v12) (pred_9 ?v2))
:effect (and (pred_7 ) (pred_2 ?v2 ?v12) (not (pred_9 ?v2)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_01 obj_22 obj_06 obj_17 obj_07 obj_21 obj_02 obj_20 obj_13 obj_09 obj_18 obj_12 obj_11 obj_10 obj_16
    obj_08 obj_05 obj_14
    obj_15 obj_03 obj_19
    )

    (:init
       (pred_7)

       (pred_5 obj_04)
       (pred_5 obj_01)
       (pred_5 obj_22)
       (pred_5 obj_06)
       (pred_5 obj_17)
       (pred_5 obj_07)
       (pred_5 obj_21)
       (pred_5 obj_02)
       (pred_5 obj_20)
       (pred_5 obj_13)
       (pred_5 obj_09)
       (pred_5 obj_18)
       (pred_5 obj_12)
       (pred_5 obj_11)
       (pred_5 obj_10)
       (pred_5 obj_16)
       (pred_10 obj_08)
       (pred_10 obj_05)
       (pred_10 obj_14)
       (pred_12 obj_15)
       (pred_12 obj_03)
       (pred_12 obj_19)

       (pred_4 obj_04 obj_17)
       (pred_4 obj_04 obj_01)
       (pred_4 obj_01 obj_07)
       (pred_4 obj_01 obj_22)
       (pred_4 obj_01 obj_04)
       (pred_4 obj_22 obj_21)
       (pred_4 obj_22 obj_06)
       (pred_4 obj_22 obj_01)
       (pred_4 obj_06 obj_02)
       (pred_4 obj_06 obj_22)
       (pred_4 obj_17 obj_20)
       (pred_4 obj_17 obj_07)
       (pred_4 obj_17 obj_04)
       (pred_4 obj_07 obj_13)
       (pred_4 obj_07 obj_21)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_07 obj_17)
       (pred_4 obj_21 obj_09)
       (pred_4 obj_21 obj_02)
       (pred_4 obj_21 obj_22)
       (pred_4 obj_21 obj_07)
       (pred_4 obj_02 obj_18)
       (pred_4 obj_02 obj_06)
       (pred_4 obj_02 obj_21)
       (pred_4 obj_20 obj_12)
       (pred_4 obj_20 obj_13)
       (pred_4 obj_20 obj_17)
       (pred_4 obj_13 obj_11)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_13 obj_07)
       (pred_4 obj_13 obj_20)
       (pred_4 obj_09 obj_10)
       (pred_4 obj_09 obj_18)
       (pred_4 obj_09 obj_21)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_18 obj_16)
       (pred_4 obj_18 obj_02)
       (pred_4 obj_18 obj_09)
       (pred_4 obj_12 obj_11)
       (pred_4 obj_12 obj_20)
       (pred_4 obj_11 obj_10)
       (pred_4 obj_11 obj_13)
       (pred_4 obj_11 obj_12)
       (pred_4 obj_10 obj_16)
       (pred_4 obj_10 obj_09)
       (pred_4 obj_10 obj_11)
       (pred_4 obj_16 obj_18)
       (pred_4 obj_16 obj_10)
       (pred_3 obj_22)
       (pred_3 obj_17)
       (pred_3 obj_16)
       (pred_6  obj_22 obj_08)
       (pred_6  obj_17 obj_05)
       (pred_6  obj_16 obj_14)
       (pred_1 obj_04)
       (pred_1 obj_01)
       (pred_1 obj_06)
       (pred_1 obj_07)
       (pred_1 obj_21)
       (pred_1 obj_02)
       (pred_1 obj_20)
       (pred_1 obj_13)
       (pred_1 obj_09)
       (pred_1 obj_18)
       (pred_1 obj_12)
       (pred_1 obj_11)
       (pred_1 obj_10)

       (pred_8  obj_15 obj_08)
       (pred_8  obj_03 obj_05)
       (pred_8  obj_19 obj_14)
       (pred_2 obj_15 obj_13)
       (pred_2 obj_03 obj_13)
       (pred_2 obj_19 obj_17)
       (pred_11 obj_12)
    )

    (:goal (and
       (pred_2 obj_03 obj_06)
    ))
(:constraints
  (always (not (pred_11 obj_21)))
)
)

; plan
1. (op_3 obj_12 obj_20)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_20)
   goals met: 0 of 1
2. (op_3 obj_20 obj_13)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_13)
   goals met: 0 of 1
3. (op_1 obj_13 obj_03)
   deleted: (pred_2 obj_03 obj_13) (pred_7)
   added: (pred_9 obj_03)
   goals met: 0 of 1
4. (op_3 obj_13 obj_09)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_09)
   goals met: 0 of 1
5. (op_3 obj_09 obj_18)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_18)
   goals met: 0 of 1
6. (op_3 obj_18 obj_02)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_02)
   goals met: 0 of 1
7. (op_3 obj_02 obj_06)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_06)
   goals met: 0 of 1
8. (op_2 obj_06 obj_03)
   deleted: (pred_9 obj_03)
   added: (pred_7) (pred_2 obj_03 obj_06)
   goals met: 1 of 1
